In [22]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          476                 71
1        UAS1         Fisika                          403                 72
2        UTS2         Fisika                          564                 77
3        UAS2         Fisika                          787                 70
4        UTS1     Matematika                          616                 84
5        UAS1     Matematika                          680                 47
6        UTS2     Matematika                          772                 66
7        UAS2     Matematika                          648                 91
8        UTS1     Statistika                          602                 69
9        UAS1     Statistika                          466                 61
10       UTS2     Statistika                          412                 62
11       UAS2     Statistika                          739                 54



---



---

## Soal 1. Data Cleaning

Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil

*   Lakukan sorting data berdasarkan Rata2 nilai ujian dari terbesar ke terkecil
*   Tipe Ujian dan Mata pelajaran apakah yang memiliki rata2 nilai terkecil?

In [16]:
#code here
nilai_ujian = df.sort_values('Rata2 Nilai Ujian', ascending=False)
print(nilai_ujian)

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
3        UAS2         Fisika                          460                 42
0        UTS1         Fisika                          472                 43
4        UTS1     Matematika                          590                 44
11       UAS2     Statistika                          643                 47
7        UAS2     Matematika                          328                 53
2        UTS2         Fisika                          228                 54
1        UAS1         Fisika                          393                 61
6        UTS2     Matematika                          378                 65
5        UAS1     Matematika                          425                 71
10       UTS2     Statistika                          550                 88
8        UTS1     Statistika                          581                 89
9        UAS1     Statistika                          546                 96

In [15]:
nilai_terkecil = df.sort_values(by=['Rata2 Nilai Ujian', 'Tipe Ujian', 'Mata Pelajaran',], ascending=True)
print(nilai_terkecil)

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
3        UAS2         Fisika                          460                 42
0        UTS1         Fisika                          472                 43
4        UTS1     Matematika                          590                 44
11       UAS2     Statistika                          643                 47
7        UAS2     Matematika                          328                 53
2        UTS2         Fisika                          228                 54
1        UAS1         Fisika                          393                 61
6        UTS2     Matematika                          378                 65
5        UAS1     Matematika                          425                 71
10       UTS2     Statistika                          550                 88
8        UTS1     Statistika                          581                 89
9        UAS1     Statistika                          546                 96

Expected output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1iv8P-LDdN3WpTVX9qST3kL7QSNSDiOc2)



---



---

<h2>Soal 2: Data Restructuring</h2>

Jelaskan itu pivoting dan melting data

Pivoting adalah suatu pengubahan bentuk data dengan memutar data yang terletak di baris menjadi di column 

Melting adalah ‘unpivoting’, melting mengubah suatu data dengan memutar dari yang tadinya berada di posisi column menjadi di posisi row.



---



---

<h2>Soal 3: Reshaping Data 1</h2>

In [25]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}

df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          335                 85
1        UAS1         Fisika                          638                 84
2        UTS2         Fisika                          761                 81
3        UAS2         Fisika                          631                 54
4        UTS1     Matematika                          790                 43
5        UAS1     Matematika                          403                 93
6        UTS2     Matematika                          516                 70
7        UAS2     Matematika                          755                 46
8        UTS1     Statistika                          249                 71
9        UAS1     Statistika                          453                 45
10       UTS2     Statistika                          362                 58
11       UAS2     Statistika                          744                 48

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [32]:
#code here
pivot_df = pd.pivot(df, index='Tipe Ujian', columns= 'Mata Pelajaran', values=['Rata2 Nilai Ujian', 'Rata2 Waktu Belajar (menit)'])

print(pivot_df)

               Rata2 Nilai Ujian                        \
Mata Pelajaran            Fisika Matematika Statistika
Tipe Ujian
UAS1                          84         93         45
UAS2                          54         46         48
UTS1                          85         43         71
UTS2                          81         70         58

               Rata2 Waktu Belajar (menit)
Mata Pelajaran                      Fisika Matematika Statistika
Tipe Ujian
UAS1                                   638        403        453
UAS2                                   631        755        744
UTS1                                   335        790        249
UTS2                                   761        516        362

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)



---



---

<h2>Soal 4: Reshaping Data 2</h2>

In [2]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
df

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

In [5]:
#code here
df.reset_index().melt(id_vars=['Hari'], var_name='Tempat Wisata', value_name='Pengunjung')

     Hari   Tempat Wisata  Pengunjung
0   Sabtu  Kebun Binatang         271
1  Minggu  Kebun Binatang         399
2   Sabtu           Dufan         501
3  Minggu           Dufan         700
4   Sabtu          Disney        1000
5  Minggu          Disney        1001
6   Sabtu            Bali         900
7  Minggu            Bali         803

Expected Result:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)



---



---

<h2>Soal 5: Data Enrichment</h2>

Lakukan binning data menggunakan qcut sehingga sesuai hasil yang diharapkan

In [35]:
#code here
labels = ['Tidak Lulus', 'Remedial', 'Lulus']
df['Status Kelulusan'] = pd.qcut(df['Rata2 Nilai Ujian'], q=3, labels=labels)
df

,Tipe Ujian,Mata Pelajaran,Rata2 Waktu Belajar (menit),Rata2 Nilai Ujian,Status Kelulusan
0,UTS1,Fisika,335,85,Lulus
1,UAS1,Fisika,638,84,Lulus
2,UTS2,Fisika,761,81,Lulus
3,UAS2,Fisika,631,54,Remedial
4,UTS1,Matematika,790,43,Tidak Lulus
5,UAS1,Matematika,403,93,Lulus
6,UTS2,Matematika,516,70,Remedial
7,UAS2,Matematika,755,46,Tidak Lulus
8,UTS1,Statistika,249,71,Remedial
9,UAS1,Statistika,453,45,Tidak Lulus
10,UTS2,Statistika,362,58,Remedial
11,UAS2,Statistika,744,48,Tidak Lulus

Expected Output:

(Output bisa berbeda-beda)

![alt text](https://drive.google.com/uc?id=1h2_u5_xhD1_QtPpItTj-o3lljHhnr4XS)



---



---